StepanenkovAnton/STM32G03x_multipurpose_firmware/STM32G030F6_I2C_Slave_device/EmbeddedProject1/EmbeddedProject1/libNMEA.h

#ifndef libNMEA_H_
#define libNMEA_H_


				  



#include "stm32g0xx_hal.h"
#include <stdlib.h>
#include <string.h>
/**
 * UART DMA buffer size definition
 */
#define NMEA_UART_DMA_BUFFER_SIZE	512
/**
 * Circular buffer size definition
 */
#define NMEA_UART_BUFFER_SIZE		1024
/**
 * Working buffer size definition
 */
#define NMEA_WORKING_BUFFER_SIZE	128
/*
 * Pointer to UART handler structure using to communication with GPS module.
 */
static UART_HandleTypeDef	*NMEA_huart;
/**
 * Pointer to DMA handler structure using to receive messages from GPS module.
 */
static DMA_HandleTypeDef	*NMEA_DMA;

/*!
 * Definition of ERROR codes (NMEA_status).
 */
typedef enum {
	NMEA_OK = 0,
	/**< operation success*/
	NMEA_BUFFER_OVERFLOWED,
	/**< circular buffer overflowed*/
	NMEA_CHECKSUM_ERROR,
	/**< invalid data received*/
	NMEA_WRONG_DATA,
	/**< wrong data passed by user (of the library)*/
	NMEA_WRONG_CB_ID,
	/**< invalid CB ID*/
	NMEA_ERROR		/**< something went wrong*/

}NMEA_status;


/*!
 * NMEA_data is a structure carrying all useful received data.
 */
typedef struct {
	/*!
	 * <pre>	
	 * time of fix
	 * format: 
	 * hhmmss		for fix rate = 1Hz or less
	 * hhmmssss		for fix rate > 1Hz 
	 * </pre>
	 */
	uint32_t	UTC_time;
	/*!	 
	 * <pre>
	 * date of fix
	 * format:	MMDDYY 
	 * </pre>
	 */
	int			UT_date;
	/*!	 
	 * <pre>
	 * latitude of position
	 * format:	DDDMM.MMMM 
	 * </pre>
	 */
	//float	latitude;
	
	uint32_t	latitude_xxxxx_00000;
	uint32_t	latitude_00000_xxxxx;

	
	
	/*!	 
	 * <pre>
	 * latitude direction
	 * N or S
	 * </pre>
	 */
	char 		latitude_direction;
	/*!	 
	 * <pre>
	 * longitude of position
	 * format:	DDDMM.MMMM 
	 * </pre>
	 */
	//float		longitude;
	uint32_t	longitude_xxxxx_00000;
	uint32_t	longitude_00000_xxxxx;

	
	
	
	/*!	 
	 * <pre>
	 * longitude direction
	 * E or W
	 * </pre>
	 */
	char 		longitude_direction;
	/*!	 
	 * <pre>
	 * Antenna altitude above mean-sea-level
	 * units of antenna altitude:	meters
	 * </pre>
	 */
	uint32_t	altitude;
	/*!	 
	 * <pre>
	 * Geoidal separation
	 * units of geoidal separation:	meters
	 * </pre>
	 */
	uint32_t	geoidal_separation;
	/*!	 
	 * <pre>
	 * Speed over ground
	 * units of speed:	kilometers/hour
	 * </pre>
	 */
	double		speed_kmph;
	/*!	 
	 * <pre>
	 * Speed over ground
	 * units of speed:	knots
	 * </pre>
	 */
	//float		speed_knots;
	/*!	 
	 * <pre>
	 * Number of satellites in view
	 * </pre>
	 */
	uint8_t		sat_in_view;
	/*!	 
	 * <pre>
	 * Number of satellites in use
	 * </pre>
	 */
	uint8_t		sat_in_use;
	/*!	 
	 * <pre>
	 * Fix flag 
	 * 0 - Invalid
	 * 1 - GPS fix
	 * </pre>
	 */
	uint8_t		fix;
	/*!	 
	 * <pre>
	 * Fix mode 
	 * 1 - Fix not available
	 * 2 - 2D mode
	 * 3 - 3D mode
	 * </pre>
	 */
	uint8_t		fix_mode;
	/*!	 
	 * <pre>
	 * Position dilution of precision (3D)
	 * units:	meters
	 * </pre>
	 */
	uint32_t		PDOP;
	/*!	 
	 * <pre>
	 * Horizontal dilution of precision
	 * units:	meters
	 * </pre>
	 */
	uint32_t		HDOP;
	/*!	 
	 * <pre>
	 * Vertical dilution of precision 
	 * units:	meters
	 * </pre>
	 */
	uint32_t		VDOP;

}NMEA_data;
/**
 * NMEA_data instance declaration.
 */

/**
 * NMEA_CB_ID's are id's using during event cb registration.
 */
typedef enum {
	SPEED_CHANGE_CB = 0,
	/**< Id of callback to change of speed event.*/
	SPEED_RISE_BARRIER_CB,
	/**< Id of callback to cross the rise speed barrier event.*/
	SPEED_FALL_BARRIER_CB	/**< Id of callback to cross the fall speed barrier event.*/
}NMEA_CB_ID;

/**
 * NMEA_init is a function to initialize library.\n
 * You should place it before while() loop. 
 * @param[in] 	huart 	is a pointer to UART_HandleTypeDef used to comunicate with GPS module.
 * @param[in]	DMA		is a pointer to DMA_HandleTypeDef used to receive data from module.
 */
void NMEA_init(UART_HandleTypeDef *huart, DMA_HandleTypeDef	*DMA);

/**
 * NMEA_process_task is a function that handles the processing data from module.\n
 * You should place it inside while() loop. 
 * @param[out]	NMEA_status is a status code. It should be NMEA_OK. For more information check out NMEA_status documentation.
 */
NMEA_status NMEA_process_task(void);
/**
 * NMEA_CB_register is a function used to register callback functions.\n
 * Thanks to it you can customize program behavior for incoming events and realize measurements, monitoring parameters etc.
 * @param[in]	CB_fun	is a pointer to callback function which will be triggered after specified event. 
 * @param[in]	CB_id	is a NMEA_CB_ID which specifies event.
 * @param[in]	barrier	is a float value determining if the cb should be triggered or not (speed barrier, delta of speed etc).
 * @param[out]	NMEA_status 	is a status code. It should be NMEA_OK. For more information check out NMEA_status documentation.
 */
NMEA_status NMEA_CB_register(void(*CB_fun)(void), NMEA_CB_ID CB_id, float barier);
/**
 * NMEA_CB_unregister is a function used to unregister specified callback function.\n
 * Thanks to it you delete selected callback. 
 * @param[in]	CB_id	is a NMEA_CB_ID which specifies event.
 * @param[out]	NMEA_status 	is a status code. It should be NMEA_OK. For more information check out NMEA_status documentation.
 */
NMEA_status NMEA_CB_unregister(NMEA_CB_ID CB_id);

/**
 * convertNMEAtoI2C is a function used for an 8-bit sequental I2C suitable representation of an NMEA strictured data.\n 
 * @nmea_input	strictured  decoded GPS data
 * @pI2C_output	an I2C byte sequence buffer
 */
void convertNMEAtoI2C(NMEA_data nmea_input, uint8_t *I2C_output);



/**
 * user_IDLE_IT_handler is a function that detects UART idle IT and handles it.\n
 * It should be used in void "UARTX_IRQHandler(void)" from "stm32XXxx_it.c" file like this:
 *@code
void UART4_IRQHandler(void)
{
	//USER CODE BEGIN UART4_IRQn 0
	
	user_UART_IDLE_IT_handler();
	
	//USER CODE END UART4_IRQn 0
  	...
 *@endcode
 */
NMEA_status user_UART_IDLE_IT_handler(void);


#endif // libNMEA_H_